// * Define a list of config plans
const plans = [
  // 30 روزه
  {
    id: "plan30_10",
    name: "🔹 10 گیگ - 30 روزه",
    days: 30,
    gig: 10,
    price: 15300, // (30*200)+(10*300)=9000 *1.7=15300
  },
  {
    id: "plan30_50",
    name: "🔹 50 گیگ - 30 روزه",
    days: 30,
    gig: 50,
    price: 35700, // 21000 * 1.7
  },
  {
    id: "plan30_100",
    name: "🔹 100 گیگ - 30 روزه",
    days: 30,
    gig: 100,
    price: 61200, // 36000 * 1.7
  },
  {
    id: "plan30_200",
    name: "🔹 200 گیگ - 30 روزه",
    days: 30,
    gig: 200,
    price: 112200, // 66000 * 1.7
  },

  // 60 روزه
  {
    id: "plan60_50",
    name: "🔸 50 گیگ - 60 روزه",
    days: 60,
    gig: 50,
    price: 45900, // 27000 * 1.7
  },
  {
    id: "plan60_100",
    name: "🔸 100 گیگ - 60 روزه",
    days: 60,
    gig: 100,
    price: 71400, // 42000 * 1.7
  },
  {
    id: "plan60_200",
    name: "🔸 200 گیگ - 60 روزه",
    days: 60,
    gig: 200,
    price: 122400, // 72000 * 1.7
  },
  {
    id: "plan60_300",
    name: "🔸 300 گیگ - 60 روزه",
    days: 60,
    gig: 300,
    price: 173400, // 102000 * 1.7
  },

  // 90 روزه
  {
    id: "plan90_100",
    name: "🔷 100 گیگ - 90 روزه",
    days: 90,
    gig: 100,
    price: 81600, // 48000 * 1.7
  },
  {
    id: "plan90_200",
    name: "🔷 200 گیگ - 90 روزه",
    days: 90,
    gig: 200,
    price: 132600, // 78000 * 1.7
  },
  {
    id: "plan90_300",
    name: "🔷 300 گیگ - 90 روزه",
    days: 90,
    gig: 300,
    price: 183600, // 108000 * 1.7
  },
  {
    id: "plan90_500",
    name: "🔷 500 گیگ - 90 روزه",
    days: 90,
    gig: 500,
    price: 285600, // 168000 * 1.7
  },
];

export default plans;
