export const WELCOME_MESSAGE = `🤖 به ربات سویفت خوش آمدید...

🚀 سویفت سرویسی از نوع شتاب دهنده اینترنت شما با لوکیشن‌های مختلف

📱 امکان اتصال در اندروید، ویندوز، آیفون و...

🌐 قابل استفاده بر روی تمام اینترنت‌ها

🔻 از این پایین یک گزینه رو انتخاب کن.️️`;

export const CHOOSE_OPTION_MESSAGE = `🔻لطفا یکی از گزینه های موجود را انتخاب کنید :`;

export function getTestServiceMessage({
  maxUser,
  maxUsageMB,
  smartLink,
  singleLink,
}) {
  return `🎉 سرویس تست 1 روزه شما با موفقیت فعال شد.\n\n👤 حداکثر اتصال: ${maxUser} کاربر\n📥 مصرف مجاز: ${maxUsageMB} گیگابایت\n\n🔗 لینک هوشمند اتصال ( شامل تمام لوکیشن ها ) :\n\n<code>${smartLink}</code>\n\n👈 لینک تکی از لوکیشن پیشنهادی :\n<code>${singleLink}</code>\n\nبرای کپی کردن لینک، روی آن لمس طولانی کنید یا راست‌کلیک کنید.\n\n⚠️ کانکشن های ما از نوع هوشمند ( Subscription ) میباشد و برای اتصال به لینک هوشمند میبایست راهنمای زیر را مشاهده کنید`;
}
